<?php
get_header('app');
function get_current_order_id() {
    global $wp;

    if (isset($wp->query_vars['order-received'])) {
        return intval($wp->query_vars['order-received']);
    }

    if(isset($wp->query_vars['order'])){
        return intval($wp->query_vars['order']);
    }

    return null;
}

$order_id = get_current_order_id();
$data = $_POST;
?>
<header class="page-row">
    <div class="head-row">
        <div class="head-row-left">
            <span>#<?= $order_id?></span>
        </div>
    </div>
</header>
<main class="main">
    <div class="text-page page-row">
        <div class="text-page-content thanks-page container">
            <?php
            if(empty($data)){
                ?>
                    <div class="thanks-page-content container">
                        <div>
                            <h3><?php _e('Дякуємо за замовлення!', 'beautysystema')?></h3>
                        </div>
                        <a href="<?= home_url();?>" class="btn btn-big btn-grd">
                            <span><?php _e('Продовжити покупки', 'beautysystema')?></span>
                        </a>
                    </div>
                    <?php
            }else{
                if($data['transactionStatus'] == 'Approved'){
                    ?>
                    <div class="thanks-page-content container">
                        <div>
                            <h3><?php _e('Дякуємо за замовлення!', 'beautysystema')?></h3>
                        </div>
                        <a href="<?= home_url();?>" class="btn btn-big btn-grd">
                            <span><?php _e('Продовжити покупки', 'beautysystema')?></span>
                        </a>
                    </div>
                    <?php
                }else{
                    ?>
                    <div class="thanks-page-content container error_page error_payment">
                        <div class="error_page-content error_page_main-content">                
                            <div class="error_page_text-block">
                                <svg class="error_icon" width="124" height="124" viewBox="0 0 124 124" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <g clip-path="url(#clip0_5239_102941)">
                                    <path
                                        d="M76.7457 50.9123L65.658 62L76.7457 73.0877C77.7532 74.0952 77.7532 75.733 76.7457 76.7405C76.2393 77.2468 75.578 77.4948 74.9167 77.4948C74.2553 77.4948 73.594 77.2417 73.0877 76.7405L62 65.6528L50.9123 76.7405C50.406 77.2468 49.7447 77.4948 49.0833 77.4948C48.422 77.4948 47.7607 77.2417 47.2543 76.7405C46.2468 75.733 46.2468 74.0952 47.2543 73.0877L58.342 62L47.2543 50.9123C46.2468 49.9048 46.2468 48.267 47.2543 47.2595C48.2618 46.252 49.8997 46.252 50.9072 47.2595L61.9948 58.3472L73.0825 47.2595C74.09 46.252 75.7278 46.252 76.7353 47.2595C77.7428 48.267 77.7428 49.9048 76.7353 50.9123H76.7457ZM88.5928 76.7457C89.0992 77.252 89.7605 77.5 90.4218 77.5C91.0832 77.5 91.7445 77.2468 92.2508 76.7457L103.338 65.658L114.426 76.7457C114.932 77.252 115.594 77.5 116.255 77.5C116.916 77.5 117.578 77.2468 118.084 76.7457C119.092 75.7382 119.092 74.1003 118.084 73.0928L106.996 62.0052L118.084 50.9175C119.092 49.91 119.092 48.2722 118.084 47.2647C117.077 46.2572 115.439 46.2572 114.431 47.2647L103.344 58.3523L92.256 47.2647C91.2485 46.2572 89.6107 46.2572 88.6032 47.2647C87.5957 48.2722 87.5957 49.91 88.6032 50.9175L99.6908 62.0052L88.6032 73.0928C87.5957 74.1003 87.5957 75.7382 88.6032 76.7457H88.5928ZM35.4123 47.2595C34.4048 46.252 32.767 46.252 31.7595 47.2595L20.6718 58.3472L9.58417 47.2595C8.57667 46.252 6.93883 46.252 5.93133 47.2595C4.92383 48.267 4.92383 49.9048 5.93133 50.9123L17.019 62L5.93133 73.0877C4.92383 74.0952 4.92383 75.733 5.93133 76.7405C6.43767 77.2468 7.099 77.4948 7.76033 77.4948C8.42167 77.4948 9.083 77.2417 9.58933 76.7405L20.677 65.6528L31.7647 76.7405C32.271 77.2468 32.9323 77.4948 33.5937 77.4948C34.255 77.4948 34.9163 77.2417 35.4227 76.7405C36.4302 75.733 36.4302 74.0952 35.4227 73.0877L24.335 62L35.4227 50.9123C36.4302 49.9048 36.4302 48.267 35.4227 47.2595H35.4123ZM33.5833 0.00516667H23.25C10.4315 0 0 10.4315 0 23.25V33.5833C0 35.0093 1.15733 36.1667 2.58333 36.1667C4.00933 36.1667 5.16667 35.0093 5.16667 33.5833V23.25C5.16667 13.2783 13.2783 5.16667 23.25 5.16667H33.5833C35.0093 5.16667 36.1667 4.00933 36.1667 2.58333C36.1667 1.15733 35.0093 0 33.5833 0V0.00516667ZM33.5833 118.838H23.25C13.2783 118.838 5.16667 110.727 5.16667 100.755V90.4218C5.16667 88.9958 4.00933 87.8385 2.58333 87.8385C1.15733 87.8385 0 88.9958 0 90.4218V100.755C0 113.574 10.4315 124.005 23.25 124.005H33.5833C35.0093 124.005 36.1667 122.848 36.1667 121.422C36.1667 119.996 35.0093 118.838 33.5833 118.838ZM121.417 87.8385C119.991 87.8385 118.833 88.9958 118.833 90.4218V100.755C118.833 110.727 110.722 118.838 100.75 118.838H90.4167C88.9907 118.838 87.8333 119.996 87.8333 121.422C87.8333 122.848 88.9907 124.005 90.4167 124.005H100.75C113.568 124.005 124 113.574 124 100.755V90.4218C124 88.9958 122.843 87.8385 121.417 87.8385ZM100.75 0H90.4167C88.9907 0 87.8333 1.15733 87.8333 2.58333C87.8333 4.00933 88.9907 5.16667 90.4167 5.16667H100.75C110.722 5.16667 118.833 13.2783 118.833 23.25V33.5833C118.833 35.0093 119.991 36.1667 121.417 36.1667C122.843 36.1667 124 35.0093 124 33.5833V23.25C124 10.4315 113.568 0 100.75 0Z"
                                        fill="#D0D5DD" />
                                </g>
                                <defs>
                                    <clipPath id="clip0_5239_102941">
                                        <rect width="124" height="124" fill="white" />
                                    </clipPath>
                                </defs>
                            </svg>
                                <h2><?php _e('Оплату не завершено', 'bs')?></h2>
                                <p><?php _e('Ваше замовлення успішно створене і наразі має статус «Очікує оплати». Іноді банк або платіжний сервіс не підтверджує платіж з першої спроби — це нормально.')?></p>
                            </div>
                        
                            <div class="error-payment__bottom">
                                <h3><?php _e('Що робити далі:', 'bs')?></h3>
                                <ol class="bs-color-list">
                                    <li><?php _e('очікуйте реквізити для оплати — ми надішлемо їх у Viber або Telegram', 'bs')?></li>
                                    <li><?php _e('або зверніться до нашої служби підтримки, якщо виникли питання.', 'bs')?></li>
                                </ol>
                                <a href="<?php echo(get_field('posylannya_dlya_chatu'))?>" class="btn btn-big btn-grd">
                                    <span><?php _e('Чат з менеджером', 'bs')?></span>
                                </a>
                            </div>                        
                        </div>
                    </div>
                    <?php
                }
            }

            ?>
            
        
        </div>        
    </div>
</main>
<?php
get_footer('footer_app');